//变量=内存中的一块空间，有名字、存值、内存地址（内存地址是cpu看的）
//函数，形参（函数定义里写的变量，用作容器），实参（调用函数时传进去的具体值）
//值传递
void change(int x) {
	x = 999;
}
int main() {
	int a = 10;     //原件a = 10  
	change(a);      //复印件a，会被改成999，但不会影响原件a，还是10
}
//嵌套调用，一个函数中调用另一个函数
//递归调用，自己直接或间接调用自身，是特殊的嵌套调用
int factorial(int n) {                       //阶乘函数，递归函数典例
	if (n <= 1) {                            //类似一种循环
		return 1;                            //这里直接结束，不用else
	}return n * factorial(n - 1);            //注意，被调用的自身参数必须更小，才能起到循环的作用，使得问题规模缩小
}

